<?php


function getDebtStatus() {

    return [
        '1' => '待审核', '2' => '待修改', '3' => '待开户',
        '4' => '已开户', '41' => '第三方已确认', '5' => '合同已生成', '6' => '待匹配',
        '7' => '已放款', '8' => '已提现', '9' => '已结清',
    ];
}

function getNatureWork() {
    return [
        '1' => '企业法人', '2' => '企业股东', '3' => '个体商户',
        '4' => '企业合同工', '5' => '自由职业',
    ];
}

function getWedlock() {
    return [
        '1' => '未婚', '2' => '已婚', '3' => '离婚',
        '4' => '丧偶', '0' => '未知',
    ];
}

function getPayTypeName() {
    return [
        '1' => '等本等息', '2' => '等额本息', '3' => '等额本金', '4' => '按月还息，到期还本', '5' => '利息前置，到期还本'
    ];
}

function getBorrowTypeName() {
    return [
        '5001' => '云联贷','5002' => '快牛贷', '6002' => '薪资贷', '6003' => '法人贷', '6004' => '车辆抵押贷', '6005' => '租约贷', '6006' => '精法贷', '6007' => '按揭贷', '6008' => '房屋抵押贷A',
        '6009' => '房屋抵押贷B', '6010' => '居间贷', '6011' => '惠农贷', '6012' => '经营贷',

    ];
}

/*
 * 获取阿里云 OSS 地址
 */
function getOssUri($uri){
    if($uri == '')
        return '';
    
    $client = App::make('aliyun-oss');

    return $client->signUrl(env('OSS_BUCKET'), ltrim($uri, './'));
}